## Part 1: Explore the Data

Import the data and use Pandas to learn more about the dataset.

In [15]:
import pandas as pd

df = pd.read_csv('Resources/client_dataset.csv')
df.head()

df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [4]:
# View the column names in the data (df.columns)

In [17]:
df.columns

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number'],
      dtype='object')

In [3]:
# Use the describe function to gather some basic statistics

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [19]:
df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [4]:
# Use this space to do any additional research
# and familiarize yourself with the data.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54639 entries, 0 to 54638
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first        54639 non-null  object
 1   last         54639 non-null  object
 2   job          54639 non-null  object
 3   phone        54639 non-null  object
 4   email        54639 non-null  object
 5   client_id    54639 non-null  int64
 6   order_id     54639 non-null  int64
 7   order_date   54639 non-null  object
 8   order_week   54639 non-null  int64
 9   order_year   54639 non-null  int64
 10  item_id      54639 non-null  object
 11  category     54639 non-null  object
 12  subcategory  54639 non-null  object
 13  unit_price   54639 non-null  float64
 14  unit_cost    54639 non-null  float64
 15  unit_weight  54639 non-null  float64
 16  qty          54639 non-null  int64
 17  line_number  54639 non-null  int64
dtypes: float64(3), int64(6), object(9)
memory usage: 7.5+ MB

In [21]:
len(df)

54639

In [23]:
df['first'].value_counts()

first
Christopher    1090
Michael        1047
William         982
John            959
Jennifer        902
               ...
Sylvia            8
Joy               7
Olivia            7
Nichole           6
Desiree           6
Name: count, Length: 360, dtype: int64

In [372]:
# What three item categories had the most entries?

In [25]:
df["category"].value_counts(ascending=False).head(3)

category
consumables    23538
furniture      11915
software        8400
Name: count, dtype: int64

In [27]:
# For the category with the most entries, which subcategory had the most entries?
df["subcategory"].value_counts(ascending=False).head(1)

subcategory
bathroom supplies    6424
Name: count, dtype: int64

In [370]:
# Which five clients had the most entries in the data?

In [29]:

df["client_id"].value_counts(ascending=False).head(5)

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

In [368]:
# Store the client ids of those top 5 clients in a list.

In [121]:

top_5_clients_list=df["client_id"].value_counts(ascending=False).head(5).index.tolist()
print(top_5_clients_list)

[33615, 66037, 46820, 38378, 24741]

In [366]:
# How many total units (the qty column) did the client with the most entries order order?

In [33]:

units_total=df.loc[df['client_id'] == 33615, 'qty'].sum()
print(units_total)

64313

## Part 2: Transform the Data
Do we know that this client spent the more money than client 66037? If not, how would we find out? Transform the data using the steps below to prepare it for analysis.

In [364]:
# Create a column that calculates the subtotal for each line using the unit_price and the qty

In [35]:
df['line_subtotal']= df['unit_price'] * df['qty']
df[ ['unit_price', 'qty', 'line_subtotal']].head(2)

   unit_price  qty  line_subtotal
0     1096.80  105      115164.00
1       24.95   21         523.95

In [362]:
# Create a column for shipping price.
# Assume a shipping price of $7 per pound for orders over 50 pounds and $10 per pound for items 50 pounds or under.

In [37]:
df['total_weight'] = df['qty'] * df['unit_weight']

In [39]:
def shipping_price(total_weight):
    return 7 if total_weight > 50 else 10

In [41]:
df[ 'shipping_price' ] = df['total_weight'].apply(shipping_price)*df['total_weight']

In [43]:
df[['unit_price', 'unit_weight', 'qty', 'total_weight', 'shipping_price']].head(3)

   unit_price  unit_weight  qty  total_weight  shipping_price
0     1096.80         7.50  105        787.50         5512.50
1       24.95         1.49   21         31.29          312.90
2       13.52         1.68   39         65.52          458.64

In [360]:
# Create a column for the total price using the subtotal and the shipping price along with a sales tax of 9.25%

In [73]:
df['line_price'] = ((df['line_subtotal'] + df['shipping_price'])*1.0925).round(2)
df[['line_subtotal', 'shipping_price', 'line_price']].head(3)

   line_subtotal  shipping_price  line_price
0      115164.00         5512.50   131839.08
1         523.95          312.90      914.26
2         527.28          458.64     1077.12

In [83]:
# Create a column for the cost of each line using unit cost, qty, and
# shipping price (assume the shipping cost is exactly what is charged to the client).

In [75]:
df['line_cost'] = df['unit_cost'] * df['qty'] + df['shipping_price'] 
df[df["order_id"] == 2742071]

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,...,unit_weight,qty,line_number,line_subtotal,total_weight,shipping_price,line_price,mnfg_cost,line_cost,line_profit
3446,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,10.46,77,5,430.43,805.42,5637.94,6629.69,5872.79,5872.79,756.90
6287,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,2.60,260,0,119652.00,676.00,4732.00,135889.52,110728.80,110728.80,25160.72
20623,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,2.27,12,3,1621.44,27.24,272.40,2069.02,1241.76,1241.76,827.26
23840,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,0.54,22,1,1046.98,11.88,118.80,1273.61,897.82,897.82,375.79
24671,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,1.57,24,2,1432.56,37.68,376.80,1976.73,1693.44,1693.44,283.29
42470,Kimberly,Blair,Geographical information systems officer,477-680-9323x27378,blair.kimberly.6618@nelson.biz,78447,2742071,2023-02-27,9,2023,...,3.04,44,4,3615.92,133.76,936.32,4973.32,3623.40,3623.40,1349.92

In [ ]:
# Create a column for the profit of each line using line cost and line price

In [77]:
df['line_profit']= df['line_price'] - df['line_cost']
df[['line_price', 'line_cost', 'line_profit']].head()

   line_price  line_cost  line_profit
0   131839.08   85597.05     46242.03
1      914.26     629.79       284.47
2     1077.12     765.18       311.94
3     1543.57    1077.35       466.22
4    11364.40    8663.60      2700.80

## Part 3: Confirm your work
You have email receipts showing that the total prices for 3 orders. Confirm that your calculations match the receipts. Remember, each order has multiple lines.

Order ID 2742071 had a total price of \$152,811.89

Order ID 2173913 had a total price of \$162,388.71

Order ID 6128929 had a total price of \$923,441.25

In [358]:
# Check your work using the totals above

In [99]:
print("Order 2742071 total: ${:,.2f}".format(df[df['order_id'] == 2742071]['line_price'].sum()))
print("Order 2173913 total: ${:,.2f}".format(df[df['order_id'] == 2173913]['line_price'].sum()))
print("Order 6128929 total: ${:,.2f}".format(df[df['order_id'] == 6128929]['line_price'].sum()))

Order 2742071 total: $152,811.89
Order 2173913 total: $162,388.71
Order 6128929 total: $923,441.25

## Part 4: Summarize and Analyze
Use the new columns with confirmed values to find the following information.

In [356]:
# How much did each of the top 5 clients by quantity spend? Check your work from Part 1 for client ids.

In [308]:


print(top_5_clients_list)
top_5_clients_list_df = df[df['client_id'].isin(top_5_clients_list)]
results1 = top_5_clients_list_df.groupby('client_id')['line_price'].sum()
print(f'{"Top 5 by quantity", results1}')

[33615, 66037, 46820, 38378, 24741]
('Top 5 by quantity', client_id
24741    82268892.02
33615     8377308.52
38378    12906550.87
46820     9743794.36
66037    10259514.79
Name: line_price, dtype: float64)

In [324]:

top_5_clients_list=df["client_id"].value_counts(ascending=False).head(5).index.tolist()
print(top_5_clients_list)

[33615, 66037, 46820, 38378, 24741]

In [352]:
# Create a summary DataFrame showing the totals for the for the top 5 clients with the following information:
# total units purchased, total shipping price, total revenue, and total profit.

In [354]:
summary_df = top_5_clients_list_df.groupby('client_id')[['qty', 'shipping_price', 'line_price', 'line_cost', 'line_profit']].sum().reset_index()
print(summary_df)

   client_id     qty  shipping_price   line_price    line_cost  line_profit
0      24741  239862      5126448.37  82268892.02  45688899.71  36579992.31
1      33615   64313      1828984.89   8377308.52   6175313.91   2201994.61
2      38378   73667      3429455.40  12906550.87   9634720.98   3271829.89
3      46820   75768      1601448.84   9743794.36   7007191.64   2736602.72
4      66037   43018      1395151.85  10259514.79   7004482.98   3255031.81

In [350]:
# Define the money columns. 

shipping_totals = summary_df['shipping_price']
charged_price = summary_df['line_price']
profit = summary_df['line_profit']

# Define a function that converts a dollar amount to millions.

shipping_totals = summary_df['shipping_price'] / 1000000
charged_price = summary_df['line_price'] / 1000000
profit = summary_df['line_profit'] / 1000000

# Apply the currency_format_millions function to only the money columns.

shipping_totals = shipping_totals.map("${:,.1f}M".format)
summary_df['shipping_price'] = shipping_totals

charged_price = charged_price.map("${:,.1f}M".format)
summary_df['line_price'] = charged_price

profit = profit.map("${:,.1f}M".format)
summary_df['line_profit'] = profit


# Rename the columns to reflect the change in the money format. 

summary_df = summary_df.rename(columns={'shipping_price': 'Total Shipping (millions)'})
summary_df = summary_df.rename(columns={'line_price': 'Charged Price (millions)'})
summary_df = summary_df.rename(columns={'line_profit': 'Total Profit (millions)'})
print(summary_df)

   client_id     qty Total Shipping (millions) Charged Price (millions)  \
0      24741  239862                     $5.1M                   $82.3M
1      33615   64313                     $1.8M                    $8.4M
2      38378   73667                     $3.4M                   $12.9M
3      46820   75768                     $1.6M                    $9.7M
4      66037   43018                     $1.4M                   $10.3M

     line_cost Total Profit (millions)
0  45688899.71                  $36.6M
1   6175313.91                   $2.2M
2   9634720.98                   $3.3M
3   7007191.64                   $2.7M
4   7004482.98                   $3.3M

In [344]:
# Sort the updated data by "Total Profit (millions)" form highest to lowest and assign the sort to a new DatFrame.

summary_df.sort_values(by='Total Profit (millions)', ascending=False)

,client_id,qty,Total Shipping (millions),Charged Price (millions),line_cost,Total Profit (millions)
0,24741,239862,$5.1M,$82.3M,45688899.71,$36.6M
2,38378,73667,$3.4M,$12.9M,9634720.98,$3.3M
4,66037,43018,$1.4M,$10.3M,7004482.98,$3.3M
3,46820,75768,$1.6M,$9.7M,7007191.64,$2.7M
1,33615,64313,$1.8M,$8.4M,6175313.91,$2.2M